#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "aaafa64d20354f1bf151124136f76a33" -> "acb2a7c7e997fcc955cccb348a0434ee"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "4df5d7691f52560d5955787679151191" -> "03c85c5ea628f430e8a91a39fab73ecb"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "64cc325ec90ea68504f6b50ce4e4bca1" -> "e02cca461069cc50d17ddffb82636fa8"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "86bb915513edd14a57fb91b44ae8d00d" -> "740b4c559250d6aec32c9f52b770c137"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "c341ae1bbffc22274fc31a7ea448ab8a" -> "b1dd179f061b652eb39bed7160086955"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "3c6e9c74c7061f747a2897412f75ad5a" -> "92b452ab6ce8c349d8b35f7a73966c0d"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "ffa60d5cb2b07049816975900d2214c4" -> "ca578f188f034604cf8bac04425de352"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "aaa32839d3b34c6ed5452595e1168ea8" -> "1e774232d0c7798ed7edc758f184f6ad"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "e235172dd15cc7dd312aded7ba4acf21" -> "ec65f01b8b7d6be877c6537a0c308be4"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "5dcac26e20635e5f5b08aa6fa74c64cc" -> "4c01de7ebb4f553111931a2f9f5bc072"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "6d05ece71b1b083336dbd8d607bdffa0" -> "a669d096fc6af011a1219ea59418bdda"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "c00b7077af1fb38780c4395c6d2dd4be" -> "73d8a3e3f7c6f2987dce964e0d372fca"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "4cc374f6e5a8de89efaea95623f3bcb8" -> "5ace78ed5732a90df715127ae1843970"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "475ad51a40f882cc715671a05d8c1853" -> "85f5a1abbe082f6ea73670fc58ab9b5f"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "a933cb2b456fa38064aca50158484aa5" -> "ccc2a751bdecdcfe40a1bf5fec6ae3df"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "072df4221ffbc23687152072f2e09279" -> "29a4793a255d2bbcfbe3607ed833e009"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "9d9f43393edf63f563c65b968f0a2493" -> "fa017b3c08231fd05a04a2fb35e998cc"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "1f123b0fd7f72c50f6b76afd0ece8375" -> "af54bc9197030fedf08370f1f4ea5c74"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "4c292f23bc02070b33992596f5fb1212" -> "f38fbc7ceb3d67ce86d85fcc189851ae"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "8fbb1ec469b1fbb1edfb595bc18758e2" -> "8f0d161c26dd3d233eb7bf69cfeee5c1"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "f77c0398f13d80e2f137e2c876ece89a" -> "95815d98ab919114ae771c970a7a3a32"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "88a8d738041fcd274984ad230e0a863b" -> "1c3a4d6e6a348db16d0f0df44f451b72"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "6a9da0c1b445f9a7ff3e8720919779a9" -> "18aa06d282cb5dccd7b9e81aea18e906"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "cbd9736418ca7a78ea4077cf089e1fb2" -> "b052d4ad52ca254a5cf858be69f80c02"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "040ae9d8f398d75bdf40a56b59309f64" -> "9b0b2ac6597df4cc3d4b110be7ff10ed"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "792f2c860d44635bd57fec3e4291e91c" -> "00e5c2fc9c1e8fce69afb2b69229b604"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "39dc456180341cfcc1a1b066b545e4e4" -> "9bf0aaa14434fb98afcd19df8e4a857a"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "6e00cf7d81217d3397f1fdcd5d2be01e" -> "32793c73b942d624001d8a93c926b4dc"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "33db68fb40e1aa9029b96862491da873" -> "830079d117d7b21c7582fde6623377ec"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "fd061333ad6d2e461cda907bee49c220" -> "17b256d34497cffe36f6ff8ae89e22e1"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "bfd8c737950516e1ddd28e1135c45565" -> "7f6ab26e3ab22e35589b897d276ed76a"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "f7cd4d4c17d95f6c474584bbf3a9cf35" -> "b377462a8c96b87af3ceb699a0692f34"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "474cf58c84c75e89f1137753d8234fc0" -> "7b288a3c1e19ad48ac84ab7cf6a7385f"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "0bf87652b964b88327162abfb2439e70" -> "cfd7cf4429e4f69fb7df3f53b8b652ff"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "f7b8c25db26188128d991076c12dfde4" -> "ace48bf196a9fd0f9335867eceb05e74"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "5aeeecf18cdafd21dd0a0904a8266c37" -> "1f6b533e50decf8176c76e50795beebd"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "ab19312ad691501a1ea42c977f891b53" -> "f73e17b22ffacc33b3ae88df088847a7"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "4d9c93dd3dca13a28707483429e987a1" -> "9ab69da05220837bca3295bc3ec3ab41"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "cd1a93977d7edf03a63d39c93f641ddf" -> "678b0148a570a9fe503eb6e79d1d2483"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "0dfefd94f0fc486f2dd3155cfaee19dc" -> "772e1b39c5e09a186cd999f4ec323312"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "ce975857d3991c83ba090e543c582cbc" -> "4469fdd3042b8d2be68e7a1705b7fbc0"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "8ad1163529d160dd762b100389087af1" -> "40c29ed7017f90624a436473998de652"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "a9818148d2fa3478936d5a2ac951aa58" -> "1ef39f153a765ed5a164b5c9c965b86d"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "ed026282f7638c4fb0da9964a8b4690b" -> "933715f8940d65c95c40c26b21669c20"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "4a12dff2f92a4c2591b073f3b4f9ba0d" -> "3829825fd9cad9d6d171f2aa01c405a7"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "dMJ2RYetyQOoHUnk7C1mb/Ycpc2FhXeegai4TyQDQyg=" -> "EABlTaPgGUN3Q3/unoqxXdwfCJQbWL1xbCl3YuzsQ6k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "8Vflc/oDO1NaiARlJ79MCD+NZMpnm6RW1kte4kf+H7Y=" -> "BQ+dH07vbZ85BQLyZWRwJkUmMelfaJQynH5tjaoP4kE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "pihLiUwQJu6AapPyWgxKNfK46ikiqY5+9WK5XEH8XX4=" -> "WqW8qsSFDQDfzRvalspYI67RunjuBCdH1uBqMZpvO+U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "eZJF0NwOtbAvM7GM6KMWW7z9OYesOkNu4mKoh9YYxzg=" -> "4PgeuzjVWetyINPkj0R728bGvYE1Xak5+3sJ3w8ZsLo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "ifa6ecCsSSYmcPxGFQZaJwApiEMPJwLEJBuEcWJj1Bs=" -> "oveXALCAJHVCCDZbP3dlJyiRKlcfua1ftb2Khk8mGJ8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "AiMC9UqpZAzTLmA/Gef9JslDtV/SePhz4rw5bos9yno=" -> "dpBIqDoIg/PbuMm9g80Y1VgjjkmArIZTEiVQfMi1TLA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "hrPx9aVzHTKz9OJA4giT1iviLi3M5mxx4YD2YIxzkXg=" -> "nttGZosEs65bp4VDiS3WmrybYjfT4XcancOE7wo4gng="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "yYpNueJAJ7l2Ni/a24CVJMwtTiwTrqdyh6rMpIUbZYk=" -> "6WEHWRAARwGgi7lK5Ku6rlto/GXYoBfJ+g1qHlPk6zI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "uOZ2MS/hPze5HVwEy+FbdJW5okfwP0e6GtDDgu3ClCQ=" -> "wkqo/G9oqyswooEaglBnaXAbZ46M87+miQFCvG/LOpk="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "LoDD41PuGrhcx3LgRnB872bKkehuRJsoLBP3wSHjcCQ=" -> "rm4DtC5tuFcnuxUY5UqJp0IqS9LqK4xtykFuMZOR7YY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "qtm5VrfPzAumb1aw2oMaSyQwLOIJqo+Tf8UJows4d1o=" -> "yLINQFaiYjzAkvpiRTRYsCXp5TdmSu8lmYwLxVFPTf8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "S7mMfi6GGx9IJpBMAY4pyUDDqTQulRlJ6iPh8mitu+4=" -> "TG2x6fA5nhU6gvSE+rhbg0ghnWMdIlOn1LJ+HTqJiPs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "uigGW06hppx1vLtQxPYul/1c7Vm265YGax1V6fheCKI=" -> "b5smV9seufPB0Jcoj62ir8xTY+4V+NYCkPREOSGunX8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "JPUQRHCHIqTevZW014IFiwqrKNoSWCQFCJaT/jCgSsk=" -> "/KaqWdIlne+xMq8GO0dxFVl3l2KI+j3yigMz/E1On6E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "Cn/ClkTNO4cvcJ1ATyhiJa6GsDrg5CPsCrAvu1Whiyc=" -> "zQoXJ4RgfbGXK3yi/0lzzZIb7yuJmUR7sqnHuhoi32I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "sWvfcdb+0PGXLOJaAsvY7dOosGaIAIslv7lbjyetZGI=" -> "RuL+Wn5uogsKeHSSPT8lmkvj2ajFxqNF+86Jy3LwWII="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "jVKBGrY9hRoK/I81vCNPnU6Bp8Cu4kjO5g94yXE6pyQ=" -> "TwiEO8qeTLhcrm6+bTG/jwjzEAd3zSzYW563G6WNC8A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "SpQ/P45HZnwfaTaSfW0DNQLMpU+jeS2KVfiO4iWc0qg=" -> "iI35c5uT47vC3AdyQJiD6LjLmLGRUvd59e1h6hn8lCg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "K4CKRPND3HkYc+VAxoMw10LTt/JadOIlt6n1MP0Enkc=" -> "wuBoUgbgXebihLWVnYKdQDrzMUJXYIF320Sv6R1e4Kw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-12-20T13:41:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "jm87YVgeseLWJCEHuz240OhiBxDYP6VHxrLLRwG0MwQ=" -> "DaqY9looPHOC/Qyqg8qQvCwtUOCGFe1T9KjwxA/pIPI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "Mk/6A4ma0TB6i+uAYmE6J6AOozGoadGvXnDSVYfJaJ0=" -> "PQaZbhQAHh7qrptkpomuvCDJ6/v3cjHt0vz7hD0hdFo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "EvAvj2UeUZy9E2s9RZcvIu/3QbXng/It33Arh6VrYtc=" -> "DG5Ei0QUfwxkmrZ9pM6omwyQtBVbaMsegjKO7JeaTYA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "FUxZsh/66ln0GO8eRoywNiReMtBunldgcgyLsoX1P6k=" -> "A1oLp8LW1hBQIhWicVG2E15/d6r9nB4rczrAyEHRoUU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "Zm40WvcsB9TNc/n/lLSNIzuONtiUMmDPcTUPEMdmnIk=" -> "QbASR+1EHu/z20fLdOdaPsF9H6fttpNkHnmocOcJgnI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "YFRHKuAI8DwuegERcWoPyFt5hvOkCpmoarHeGqE4Rrg=" -> "XbdW6yaJVEDkJ2kBo3kTHnizJFTrroquemdIj3UrtEU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-12-21T19:16:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "VOIzUVm8Gq81ReLxapGHzGQ5x1ctS6tpMiDhq/7I1FM=" -> "FmmZ4CGFP7G+FwajaHXQK6yZmMu7r/oIMlCIExG4fu0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ez+qbKyzvqpGbmFUsAA7uQe9AYt49tYhNK2cZl5uuB4=" -> "ooiDpgydEhsJzoabtA/k3mLL7zV/+3JXGsAeFUQfj6k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "zo2UWO11JBGnwI+S/V00/bq2zKztDAbL6s2drtLe6qo=" -> "GUtN7PuiFUw8sGUm9ZYfJvcuVC/5FQZXAg3XC3ES+jg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "CpN7kXf5BUpDhjbkhsq7h7C3MBzf6QH6tYkjgmGLRB4=" -> "/GIkocffFEak/2tDuYWnwnDKjC9wPCHfFOxs950BCZg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "TayHhkgRq08oBb8vvpKuLWrDhXCys7lMn9WX1DwhK0I=" -> "EpnYgQq55828mLgx41mjTmE6oSl5t/sOfDPgSPEMQdk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "5N6rh+9in1mbdi3B54s/pLEbkFYy6HaX5epBIC4QYxI=" -> "3EBlpYdV2GCcLFGzi1R614YSsoIjWiRpd/XoGaxwXh4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "L84tKCG1qsTT7lE/qaD+GXHvZvX8lYZy1/Kl/WeVnpI=" -> "6Rt/5+E5wkEPpj01S23+q6A4K61uCCGYyj33BfhzVIc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "icQ4SD6Z0Rzv+Ao1v0YatTXbtWGAKir649AUhOW6rJs=" -> "0ooMDsAUpffSprz0+x8RosR3oDoy4rFIJQiXpPPdsrU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "XDV7p7EFXK7uUyWKrqqC7yRCGY2Wz37PHw5u/rgTTGQ=" -> "px8L4Wgssc10AkTw6aw26pP9lA5LmCum9UweuFjQah0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "3M1Cj9yZ81J8DyA1hLr4W9tGOTpDZ1bYAp/jtrJ8vqc=" -> "d8hxvqlf4+3ZVUeSa+FW/bUziQEOtkWZ7TIw2oFOliA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "WTQ3fdHgGUAUsf/cJCk5sZBpsxTXruVgqitFqUqe44I=" -> "fYa55lN6c9NYb3GvSXgzQkBvwjeWZiNXUV2ObKlJm74="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "hEd7mdbyJzq9Q4TrdZkvTjd6c/9LE5NNqvVJPwWA480=" -> "AEcEiT7SjKkKdjSEZ/Q30XobH79T/AgDNEsMfxCyB3A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "B5dRypOnUx0Kw+aRB1XcwvyBA+fs3cBlSC66Sdp4+wA=" -> "tfsl2XKtxwWz8FH2AoHFy508gxTt0tvjKbP7qu8Mm2Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "ISTmuW3opF9ke6bTCLv3qInFZgiMI0TXtYyLa7H7xu0=" -> "OBW0UuvvStTMaqYGh7qXK4lZmi7XH9+MV20X/VvGtJs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "+GdiKRF6JkyixBnptQEFbdEwQ1aARI2YWWZOoG7mc/g=" -> "dZgT3kxhkjoUQrh/eFfk0Bnd/zaw8YUMfonWG3Bk6FA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "2pBtKLBB4TJm2OYYC6MFDTiXTl//uP5wN3uwfbL3MSs=" -> "CZhmnqlQrDRalawUd8x7KaiMD8ehjmqsQe4P4PyUBtM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "ALCqK5jK2Ms+4Cq/ZaGIM3qkYOUpXF9VFW2Lra2zKoQ=" -> "CQYkAoplhu3KjBaHtMWI5R9FJz4DR72PRxA9gDgkLoU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "g9CBtcCh+khAXW/zd6pEp1Bok0sqX1YFYbvRvdT1PHE=" -> "glfvBmCA323t6AR7oNf+IT1TmbPk/SAtF1phXJRTcPo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "LDA67S1nSq2oZgjLN4yI+RszXHWfX6oTN47dst398O8=" -> "/I1D0KQ2tWXmk2uQ5yBNwwKeSznnWz3+WV35KT4bWR4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-12-15T20:57:31Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "y2uxop" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-12-15T20:57:30Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-12-15T20:57:29Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 91 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*